app/views/profiles/show.html.erb

  <div class="posts-container">
    <% @user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1 LIMIT 1