app/controllers/api/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    render json: Post.find(params[:id]).card_data