app/views/pages/_post_card.html.erb

    <div class="post-card-user-location">
      <%= post.user.city if post.user.city; post.user.state if post.user.state; post.user.country if post. user.country %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1