app/views/posts/_artist_posts.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = 1
---
<div class="posts-container">
  <% @user.posts.each do |post| %>