app/controllers/pages_controller.rb

SELECT "posts".* FROM "posts" LIMIT 20
---
  def index
	@posts = Post.organize_by_hype.paginate(:page => params[:page], :per_page => 8)