app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "description", "hype", "title", "updated_at", "user_id", "youtube_url") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", Fri, 28 Feb 2014 08:46:53 UTC +00:00], ["description", ""], ["hype", nil], ["title", ""], ["updated_at", Fri, 28 Feb 2014 08:46:53 UTC +00:00], ["user_id", nil], ["youtube_url", ""]]
---
  def create
    @post = Post.new(params[:post])
    if @post.save