app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "users" SET "featured_youtube_url" = 'http://www.youtube.com/watch?v=O4No-_RSj64', "updated_at" = '2014-02-28 22:21:50.494601' WHERE "users"."id" = 3